import AllText from "../i18n/Language";


let MonsterATK: number[][] = [[5, 7, 12, 15, 22, 27, 33, 39, 44, 50, 65, 79, 86, 92, 100, 110, 120, 125, 131, 142, 175, 190, 210, 220, 230, 250, 270, 275, 300, 330, 360, 380, 390, 420, 445, 460, 510, 550, 590, 650], [59, 64, 74, 82, 94, 104, 116, 127, 137, 149, 173, 195, 208, 219, 234, 251, 268, 278, 289, 307, 357, 381, 412, 422, 439, 470, 501, 511, 549, 594, 639, 670, 687, 732, 770, 794, 867, 926, 985, 1072], [195, 206, 223, 238, 257, 274, 294, 312, 329, 348, 382, 414, 434, 452, 475, 501, 526, 543, 561, 588, 653, 687, 729, 746, 771, 814, 856, 873, 923, 982, 1041, 1084, 1109, 1168, 1219, 1252, 1345, 1421, 1497, 1606]];

let MonsterHP: number[][] = [[180, 240, 300, 360, 460, 640, 750, 860, 950, 1070, 1220, 1450, 1620, 1740, 1900, 2100, 2150, 2250, 2350, 2450, 2500, 2500, 2550, 2650, 2650, 2750, 2850, 2950, 3000, 3100, 3100, 3200, 3300, 3400, 3500, 3600, 3700, 3850, 4200, 4400], [1196, 1288, 1380, 1472, 1612, 1848, 2000, 2152, 2280, 2444, 2644, 2940, 3164, 3328, 3540, 3800, 3880, 4020, 4160, 4200, 4380, 4400, 4480, 4620, 4640, 4780, 4920, 5060, 5140, 5280, 5300, 5440, 5580, 5720, 5860, 6000, 6140, 6340, 6780, 7040], [2065, 2205, 2346, 2486, 2684, 2997, 3210, 3422, 3606, 3832, 4102, 4488, 4786, 5013, 5298, 5640, 5766, 5964, 6162, 6240, 6486, 6540, 6666, 6864, 6918, 7116, 7314, 7512, 7638, 7836, 7890, 8088, 8286, 8484, 8682, 8880, 9078, 9348, 9906, 10248]];

let MonsterArmor: number[][] = [[0, 0, 0, 30, 49, 50, 60, 80, 90, 120, 155, 220, 260, 300, 350, 400, 450, 500, 500, 500, 700, 700, 700, 800, 1000, 1100, 1100, 1100, 1200, 1500, 1500, 1600, 1700, 1800, 2000, 2100, 2200, 2300, 2400, 3000], [140, 150, 170, 223, 263.9, 285, 316, 358, 389, 442, 500.5, 592, 656, 720, 795, 870, 945, 1020, 1040, 1060, 1300, 1320, 1340, 1470, 1710, 1840, 1860, 1880, 2010, 2360, 2380, 2510, 2640, 2770, 3010, 3140, 3270, 3400, 3530, 4210], [438, 480, 534, 627, 706, 762, 829, 909, 976, 1070, 1170, 1310, 1417, 1524, 1644, 1764, 1884, 2004, 2058, 2112, 2430, 2484, 2538, 2724, 3042, 3228, 3282, 3336, 3522, 3972, 4026, 4212, 4398, 4584, 4902, 5088, 5274, 5460, 5646, 6492]];

let RewardCoins: number[][] = [[20, 25, 35, 50, 80, 85, 95, 105, 150, 140, 145, 165, 175, 195, 235, 215, 225, 245, 265, 335, 320, 330, 340, 355, 435, 420, 435, 450, 465, 500, 525, 550, 575, 600, 620, 645, 670, 695, 720, 800], [149, 160, 177, 200, 241, 252, 269, 286, 345, 338, 349, 378, 395, 424, 477, 458, 475, 504, 533, 622, 609, 626, 643, 666, 767, 754, 777, 800, 823, 870, 905, 940, 975, 1010, 1039, 1074, 1109, 1144, 1179, 1280], [304, 324, 350, 384, 439, 458, 484, 511, 588, 585, 604, 645, 672, 712, 782, 765, 792, 832, 873, 986, 976, 1003, 1029, 1063, 1190, 1180, 1214, 1248, 1281, 1344, 1392, 1440, 1488, 1536, 1576, 1624, 1672, 1720, 1768, 1896]];

let RewardExp: number[][] = [[5, 10, 15, 20, 25, 30, 45, 35, 40, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 210, 220, 200, 205, 215, 225, 235, 245, 255, 300, 275, 285, 295, 305, 315, 325, 400, 450], [64, 74, 84, 94, 104, 114, 136, 128, 138, 148, 164, 180, 196, 212, 228, 244, 260, 276, 292, 308, 324, 340, 398, 414, 394, 404, 420, 436, 452, 468, 484, 542, 516, 532, 548, 564, 580, 596, 690, 754], [137, 156, 175, 194, 213, 232, 266, 263, 282, 301, 327, 354, 380, 406, 432, 458, 485, 511, 537, 563, 589, 616, 692, 718, 701, 720, 747, 773, 799, 825, 851, 928, 904, 930, 956, 982, 1009, 1035, 1155, 1238]];
				
					
					
					
  
				
					
					
					


let Exp: number[] = [10, 30, 60, 100, 150, 210, 280, 360, 450, 550, 670, 810, 970, 1150, 1350, 1570, 1810, 2070, 2350, 2650, 2970, 3310, 3670, 4050, 4450, 4870, 5310, 5770, 6250, 6750, 7270, 7810, 8370, 8950, 9550, 10170, 10810, 11470, 12150, 12850, 
    13570, 14310, 15070, 15850, 16650, 17470, 18310, 19170, 20050, 20950, 21870, 22810, 23770, 24750, 25750, 26770, 27810, 28870, 29950, 31050, 32170, 33310, 34470, 35650, 36850, 38070, 39310, 40570, 41850, 43150, 44470, 45810, 47170, 48550, 49950, 51370, 52810, 54270, 55750, 57250,
     58770, 60310, 61870, 63450, 65050, 66670, 68310, 69970, 71650, 73350, 75070, 76810, 78570, 80350, 82150, 83970, 85810, 87670, 89550, 92050, 94550, 97050, 99550, 102050, 104550, 107050, 109550, 112050, 114550, 117050, 119550, 122050, 124550, 127050, 129550, 132050, 134550, 137050, 139550, 142050];
					

        
     				
let TipString: string[] = ["武魂是特殊宝石，可以给装备附加额外属性", "装备可以使用金币升级，提升更多战斗力", "技能可以使用金币升级，威力会更强喔", "神宠可以使用钻石升级，提升更多战斗力", "关卡挑战的星星，可以解锁地图左下角的关卡宝箱", "不同关卡可以使用不同人物通关", "进入排行榜前100名，可以在成就中领取钻石喔", "查看并完成每日任务，可以获得大量钻石福利喔", "连续7天签到就可以获得稀有神宠！", "低级武魂可以进阶成高级武魂（需要消耗其他武魂）", "等级提升后，可以去成就领取奖励"];                    
                         
                     
					
					
					
					
					


/**
 * 第一位 数量
 * 第二位 颜色
 * 第三四位 种类 //从0开始依次 刀 枪 箭塔弓 弓 狂战近战 狂战远程 象 鹰 方术士
 */
// let MapData = [{lv: 1, boxId: 0,/**0代表没有 */ rewardId: [1123], wave:[3], monster: [[3101, 3101, 1103], [3101, 2105, 1106], [6107, 3106, 1105]]}, ]; //666随机
// 刀兵 100枪兵 101 弓兵 103 近狂战 104 远狂战 105象 106鹰 107术士 108
// 11101 青云枪 11202 毒龙枪 11303 霸王枪 12104 霜月弓 12205 裁决 12306 落日 13107 赤玉 13208 鬼火 13309 幽冥 
// 21101 灵蛇甲 21302 八部天龙 21203 毒龙铠 22104 寒蝉衣 22205 白鹤羽 22306 夜琉璃 23107 浑天绫 23208 缠天带 23309 九彩霓裳
// 30105 紫晶戒  30104 盘龙  30107 碧玉  30203 天芒  30202 守城 30206 将臣 30301 情人泪 30308 似水流年
// 40101 神行符 40102 金刚符 40103 灵蛇玉 40204 千年琥珀  40306 玄铁项链 40207 通灵宝玉 40305烛龙之瞳 
// 50101 九幽寒 50105 幻影无极翼  50204 蝶恋花  50306 血海彼岸花  50303 涅槃神凤翼  50302 修罗霸王翼
// 60101 ~60601 狼-饕餮 主暴击
// 60102 ~60602 蛇到龙 闪避 穿透
// 60103 ~60603 鹤到凤凰 穿透 暴击 
// 60104 ~60604 龟到混沌 防御 攻击 最强！
// 60105 ~60605 虎到穷奇 攻击 后期有吸血 超强！！
// 60106 ~60606 狐狸到九尾  减cd 法师流
// 60107 ~60507 鱼到鲲 hp 很强
// 60108 ~60508 鹰到鹏 移速暴击 一般 
// 60609 鲲鹏 终极强无敌！

let MapData = 
// [
//     {"lv":1,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":[[40101],[40103],[40204]],"itemrate":[[1],[0.5],[0.4,]],"cave":"","wave":1,"monster":[[3100,3101]],"boss":""},
//     {"lv":2,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":1,"wave":1,"monster":[[2101,1201,2103],[2101,1101,2203]],"boss":""},
//     {"lv":3,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":"","wave":2,"monster":[[1101,2101,2104]],"boss":""},
//     {"lv":4,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":"","wave":1,"monster":[[1101,3102,1104],[2105,1104,3107]],"boss":""},
//     {"lv":5,"soul":[[60100],[60200],[60300]],"soulrate":[[0.2],[0.3],[0.4]],"item":[[30104],[30202],[30206]],"itemrate":[[1],[0.5],[0.4]],"cave":1,"wave":1,"monster":[[3105,3101,2107],[2107,1105,2100]],"boss":1197},
//     {"lv":6,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":"","wave":1,"monster":[[3101,2101,3108],[3101,2108,2106]],"boss":""},
//     {"lv":7,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":[[40103],[40207],[40305]],"itemrate":[[0.5],[0.4],[0.4]],"cave":"","wave":1,"monster":[[3100,3101,1103],[3101,2105,3106]],"boss":""},
//     {"lv":8,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":"","wave":1,"monster":[[3101,3101,1108],[3101,2107,3106]],"boss":""},
//     {"lv":9,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":"","wave":1,"monster":[[3201,1101,3108],[4201,4105,2107]],"boss":""},
//     {"lv":10,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[30105]],"itemrate":[[0.5]],"cave":1,"wave":1,"monster":[[2205,2104,2103],[2208,3105,2108],[6107,1105]],"boss":1197},
//     {"lv":11,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[21203]],"itemrate":[[0.35]],"cave":"","wave":2,"monster":[[3201,2201,1203],[1107,2106,2105]],"boss":""},
//     {"lv":12,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[22205]],"itemrate":[[0.5]],"cave":"","wave":2,"monster":[[2200,2101,3203],[2107,2106,1105]],"boss":""},
//     {"lv":13,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[12205]],"itemrate":[[0.3]],"cave":1,"wave":1,"monster":[[3101,3201,3105],[3105,4103,2106],[2104,3108,3106]],"boss":""},
//     {"lv":14,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[11202]],"itemrate":[[0.3]],"cave":"","wave":1,"monster":[[2201,4201,5103],[3101,3104,2106],[2107,3106,3105]],"boss":""},
//     {"lv":15,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[30202],[30203],[30301]],"itemrate":[[0.3],[0.4],[0.4]],"cave":1,"wave":2,"monster":[[2201,2200,1104],[2104,1105,2106],[1108,2106,2105]],"boss":1198},
//     {"lv":16,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[40204],[40207],[40306]],"itemrate":[[0.3],[0.4],[0.4]],"cave":"","wave":2,"monster":[[3200,2201,1108],[2108,1105,2106],[5106]],"boss":""},
//     {"lv":17,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[12205]],"itemrate":[[0.3]],"cave":1,"wave":2,"monster":[[6108],[4103,1105],[2105,4104]],"boss":""},
//     {"lv":18,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[22205]],"itemrate":[[0.3]],"cave":1,"wave":2,"monster":[[2200,3106],[3104,3105],[6105]],"boss":""},
//     {"lv":19,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":"","wave":2,"monster":[[2201,4107],[2108,2105,1106],[3107,3106,1108]],"boss":""},
//     {"lv":20,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[40204],[40207],[40306]],"itemrate":[[0.4],[0.4],[0.4]],"cave":"","wave":2,"monster":[[3201,3104,1108],[3201,2105,1106],[6106]],"boss":1198},
//     {"lv":21,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[21203]],"itemrate":[[0.3]],"cave":"","wave":3,"monster":[[3301,2201,2207],[2301,2105,3106]],"boss":""},
//     {"lv":22,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":"","wave":2,"monster":[[2301,2101,2208],[3301,2105,2106],[3208,3106,2303]],"boss":""},
//     {"lv":23,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[11303]],"itemrate":[[0.3]],"cave":1,"wave":2,"monster":[[2107,2108,2208],[3301,2105,2106],[4107,2301,2301]],"boss":""},
//     {"lv":24,"soul":[[60200],[60303],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":1,"wave":2,"monster":[[4104,4301],[3105,3303],[3104,3105,2105]],"boss":""},
//     {"lv":25,"soul":[[60300],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[12306]],"itemrate":[[0.3]],"cave":"","wave":2,"monster":[[2108,2301,1303,1106],[3300,2105,2106],[4106,2108]],"boss":1297},
//     {"lv":26,"soul":[[60300],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[40306]],"itemrate":[[0.1]],"cave":"","wave":2,"monster":[[3301,2300,2104],[3107,3105,2106],[3107,3106,2108]],"boss":""},
//     {"lv":27,"soul":[[60300],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":"","wave":3,"monster":[[3303,1201,3107],[1106,2105,1106],[1208,2106,2303]],"boss":""},
//     {"lv":28,"soul":[[60300],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":1,"wave":3,"monster":[[2106,2303,1203],[2107,2105,1106],[2108,2208,2104]],"boss":""},
//     {"lv":29,"soul":[[60300],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[11303]],"itemrate":[[0.3]],"cave":1,"wave":3,"monster":[[2104,1105,2108],[2104,2107,2208],[2303,3208,1106]],"boss":""},
//     {"lv":30,"soul":[[60300],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[30301]],"itemrate":[[0.5]],"cave":"","wave":2,"monster":[[3301,3300,4106],[3301,3105,2108],[3107,3105,3203]],"boss":1298},
//     {"lv":31,"soul":[[60300],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[40306]],"itemrate":[[0.2]],"cave":"","wave":3,"monster":[[3104,2105],[3106,3107],[2104,3106,2105]],"boss":""},
//     {"lv":32,"soul":[[60300],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[12306]],"itemrate":[[0.3]],"cave":1,"wave":3,"monster":[[3301,1302,3106],[2108,3105,1208],[2107,2106,2105]],"boss":""},
//     {"lv":33,"soul":[[60300],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[11303]],"itemrate":[[0.3]],"cave":"","wave":3,"monster":[[2303,3201,1105],[3105,2104,2106],[3104,3108]],"boss":""},
//     {"lv":34,"soul":[[60300],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[50306]],"itemrate":[[0.2]],"cave":"","wave":3,"monster":[[3106,2208,3108],[2302,2105,1106],[3107,3106,1105,1303]],"boss":""},
//     {"lv":35,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[11303]],"itemrate":[[0.3]],"cave":"","wave":3,"monster":[[2303,3105,2108],[3105,4104],[3208,3108,2106]],"boss":1197},
//     {"lv":36,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":1,"wave":3,"monster":[[2108,3301,1303,1106],[3106,2208,3108],[2106,3208,2104]],"boss":""},
//     {"lv":37,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[30308]],"itemrate":[[0.5]],"cave":1,"wave":3,"monster":[[2302,2104,1106,1303],[2307,3104,2106,1303],[3107,3106,3105]],"boss":""},
//     {"lv":38,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":"","wave":3,"monster":[[2303,2301,4106],[3301,3105,2106],[4106,4104]],"boss":""},
//     {"lv":39,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[50306]],"itemrate":[[0.3]],"cave":"","wave":3,"monster":[[2302,2105,2106,1303],[3303,3105,3208],[4107,4106,1105]],"boss":""},
//     {"lv":40,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[30308]],"itemrate":[[0.5]],"cave":1,"wave":4,"monster":[[2303,2107,2106,1105,1104],[2303,2107,2108,1105,1104],[2203,3107,1106,1208,1104]],"boss":1297},
    
//     ]

[
    {"lv":1,"soul":[[60100],[60200],[60300]],"soulrate":[[60100],[60200],[60300]],"item":[[40101],[40103],[40204]],"itemrate":[[1],[0.5],[0.4]],"cave":"","wave":1,"monster":[[3100,3101]],"boss":""},
    {"lv":2,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":1,"wave":1,"monster":[[2101,1201,2103],[2101,1101,2203]],"boss":""},
    {"lv":3,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":"","wave":2,"monster":[[1101,2101,2104]],"boss":""},
    {"lv":4,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":"","wave":1,"monster":[[1101,3102,1104],[2105,1104,3107]],"boss":""},
    {"lv":5,"soul":[[60100],[60200],[60300]],"soulrate":[[0.2],[0.3],[0.4]],"item":[[30104],[30202],[30206]],"itemrate":[[1],[0.5],[0.4]],"cave":1,"wave":1,"monster":[[3105,3101,2107],[2107,1105,2100]],"boss":1197},
    {"lv":6,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":"","wave":1,"monster":[[3101,2101,3108],[3101,2108,2106]],"boss":""},
    {"lv":7,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":[[40103],[40207],[40305]],"itemrate":[[0.5],[0.4],[0.4]],"cave":"","wave":1,"monster":[[3100,3101,1103],[3101,2105,3106]],"boss":""},
    {"lv":8,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":"","wave":1,"monster":[[3101,3101,1108],[3101,2107,3106]],"boss":""},
    {"lv":9,"soul":[[60100],[60200],[60300]],"soulrate":[[0.1],[0.2],[0.3]],"item":"","itemrate":"","cave":"","wave":1,"monster":[[3201,1101,3108],[4201,4105,2107]],"boss":""},
    {"lv":10,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[30105]],"itemrate":[[0.5]],"cave":1,"wave":1,"monster":[[2205,2104,2103],[2208,3105,2108],[6107,1105]],"boss":1197},
    {"lv":11,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[21203]],"itemrate":[[0.35]],"cave":"","wave":2,"monster":[[3201,2201,1203],[1107,2106,2105]],"boss":""},
    {"lv":12,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[22205]],"itemrate":[[0.5]],"cave":"","wave":2,"monster":[[2200,2101,3203],[2107,2106,1105]],"boss":""},
    {"lv":13,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[12205]],"itemrate":[[0.3]],"cave":1,"wave":1,"monster":[[3101,3201,3105],[3105,4103,2106],[2104,3108,3106]],"boss":""},
    {"lv":14,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[11202]],"itemrate":[[0.3]],"cave":"","wave":1,"monster":[[2201,4201,5103],[3101,3104,2106],[2107,3106,3105]],"boss":""},
    {"lv":15,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[30202],[30203],[30301]],"itemrate":[[0.3],[0.4],[0.4]],"cave":1,"wave":2,"monster":[[2201,2200,1104],[2104,1105,2106],[1108,2106,2105]],"boss":1199},
    {"lv":16,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[40204],[40207],[40306]],"itemrate":[[0.3],[0.4],[0.4]],"cave":"","wave":2,"monster":[[3200,2201,1108],[2108,1105,2106],[5106]],"boss":""},
    {"lv":17,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[12205]],"itemrate":[[0.3]],"cave":1,"wave":2,"monster":[[6108],[4103,1105],[2105,4104]],"boss":""},
    {"lv":18,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[22205]],"itemrate":[[0.3]],"cave":1,"wave":2,"monster":[[2200,3106],[3104,3105],[6105]],"boss":""},
    {"lv":19,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[13208]],"itemrate":[[0.3]],"cave":"","wave":2,"monster":[[2201,4107],[2108,2105,1106],[3107,3106,1108]],"boss":""},
    {"lv":20,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[40204],[40207],[40306]],"itemrate":[[0.4],[0.4],[0.4]],"cave":"","wave":2,"monster":[[3201,3104,1108],[3201,2105,1106],[6106]],"boss":1199},
    {"lv":21,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[21203]],"itemrate":[[0.3]],"cave":"","wave":3,"monster":[[3301,2201,2207],[2301,2105,3106]],"boss":""},
    {"lv":22,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[23208]],"itemrate":[[0.3]],"cave":"","wave":2,"monster":[[2301,2101,2208],[3301,2105,2106],[3208,3106,2303]],"boss":""},
    {"lv":23,"soul":[[60200],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[11303]],"itemrate":[[0.3]],"cave":1,"wave":2,"monster":[[2107,2108,2208],[3301,2105,2106],[4107,2301,2301]],"boss":""},
    {"lv":24,"soul":[[60200],[60308],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":1,"wave":2,"monster":[[4104,4301],[3105,3303],[3104,3105,2105]],"boss":""},
    {"lv":25,"soul":[[60300],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[12306]],"itemrate":[[0.3]],"cave":"","wave":2,"monster":[[2108,2301,1303,1106],[3300,2105,2106],[4106,2108]],"boss":1297},
    {"lv":26,"soul":[[60300],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[40306]],"itemrate":[[0.1]],"cave":"","wave":2,"monster":[[3301,2300,2104],[3107,3105,2106],[3107,3106,2108]],"boss":""},
    {"lv":27,"soul":[[60300],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":"","wave":3,"monster":[[3303,1201,3107],[1106,2105,1106],[1208,2106,2303]],"boss":""},
    {"lv":28,"soul":[[60300],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[23309]],"itemrate":[[0.3]],"cave":1,"wave":3,"monster":[[2106,2303,1203],[2107,2105,1106],[2108,2208,2104]],"boss":""},
    {"lv":29,"soul":[[60300],[60300],[60400]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[13309]],"itemrate":[[0.3]],"cave":1,"wave":3,"monster":[[2104,1105,2108],[2104,2107,2208],[2303,3208,1106]],"boss":""},
    {"lv":30,"soul":[[60300],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[30301]],"itemrate":[[0.5]],"cave":"","wave":2,"monster":[[3301,3300,4106],[3301,3105,2108],[3107,3105,3203]],"boss":1299},
    {"lv":31,"soul":[[60300],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[40306]],"itemrate":[[0.2]],"cave":"","wave":3,"monster":[[3104,2105],[3106,3107],[2104,3106,2105]],"boss":""},
    {"lv":32,"soul":[[60300],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[12306]],"itemrate":[[0.3]],"cave":1,"wave":3,"monster":[[3301,1302,3106],[2108,3105,1208],[2107,2106,2105]],"boss":""},
    {"lv":33,"soul":[[60300],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[11303]],"itemrate":[[0.3]],"cave":"","wave":3,"monster":[[2303,3201,1105],[3105,2104,2106],[3104,3108]],"boss":""},
    {"lv":34,"soul":[[60300],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[50306]],"itemrate":[[0.2]],"cave":"","wave":3,"monster":[[3106,2208,3108],[2302,2105,1106],[3107,3106,1105,1303]],"boss":""},
    {"lv":35,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[11303]],"itemrate":[[0.3]],"cave":"","wave":3,"monster":[[2303,3105,2108],[3105,4104],[3208,3108,2106]],"boss":1198},
    {"lv":36,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":1,"wave":3,"monster":[[2108,3301,1303,1106],[3106,2208,3108],[2106,3208,2104]],"boss":""},
    {"lv":37,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[30308]],"itemrate":[[0.5]],"cave":1,"wave":3,"monster":[[2302,2104,1106,1303],[2307,3104,2106,1303],[3107,3106,3105]],"boss":""},
    {"lv":38,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":"","itemrate":"","cave":"","wave":3,"monster":[[2303,2301,4106],[3301,3105,2106],[4106,4104]],"boss":""},
    {"lv":39,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[50306]],"itemrate":[[0.3]],"cave":"","wave":3,"monster":[[2302,2105,2106,1303],[3303,3105,3208],[4107,4106,1105]],"boss":""},
    {"lv":40,"soul":[[60400],[60400],[60500]],"soulrate":[[0.2],[0.3],[0.3]],"item":[[30308]],"itemrate":[[0.5]],"cave":1,"wave":4,"monster":[[2303,2107,2106,1105,1104],[2303,2107,2108,1105,1104],[2203,3107,1106,1208,1104]],"boss":1298},
    
    ]

            

            
// let BossData = [{},];



let HeroSkillName: string[][] = [
    ['skill_pd', 'skill_leidian', 'skill_leidongjiutian',  'skill_shunyi'],
    ['skill_guangbo', 'skill_duochongjian',  'skill_shunyi+gongji', 'skill_jianyu'],
    ['skill_yanlouzhan', 'skill_liuxingyu', 'skill_heidong', 'skill_dipotianxing'],
    
];

let BgName: string[][] = [['/竹林-路面', '/竹林-中景', '/竹林-背景', '/竹林-山洞', '/竹林-路面', '/竹林山洞-中景', '/竹林山洞-背景'],
['/定军山-路面', '/定军山-中景', '/定军山-背景', '/定军山-洞', '/定军山山洞-地面', '/定军山山洞-中景', '/定军山山洞-背景'],

['/雪山-路面', '/雪山-中景', '/雪山-背景', '/雪山-山洞', '/雪山-路面', '/雪山山洞-冰块', '/雪山山洞-背景'],
['/长城-路面', '/长城-中景', '/长城-背景', '/长城-门洞', '/长城-路面', '/长城-废墟', '/长城-背景']
];

let MapTitle: string[] = [AllText.mapTitle1, AllText.mapTitle2, AllText.mapTitle3, AllText.mapTitle4];
let HeroSpName: string[] = ['SP/0/xinzhaoyun', 'SP/1/diaochan_dongzuo', 'SP/2/daqiao_dongzuo'];
let PetSpName: string[] = ['SP/pet/0/fenghuang', 'SP/pet/1/qinglong', 'SP/pet/2/youkun'];
let HeroName: string[] = [AllText.heroName0, AllText.heroName1, AllText.heroName2, AllText.bossName0, AllText.bossName1, AllText.bossName2];
let PetName: string[] = [AllText.petName0, AllText.petName1, AllText.petName2];

let SkillNameArrs: string[][] = [[AllText.skillZY0, AllText.skillZY1, AllText.skillZY2, AllText.skillZY3, AllText.skillZY4, AllText.skillZY5, AllText.skillZY6],
[AllText.skillDC0, AllText.skillDC1, AllText.skillDC2, AllText.skillDC3, AllText.skillDC4, AllText.skillDC5, AllText.skillDC6],
[AllText.skillDQ0, AllText.skillDQ1, AllText.skillDQ2, AllText.skillDQ3, AllText.skillDQ4, AllText.skillDQ5, AllText.skillDQ6],
];

let AttArrs: string[] = ['atk', 'def', 'hp', 'ls', 'sp', 'cr', 'arp', 'bonus', 'cd', 'miss', 'exp', 'gold'];


// 1. 所有装备 升级规则，每样装备 最高可升到 11级，初始是1级， 升到11级 等级 变成满级
// 每次升级，每个属性提升固定值，2-6 升级的价格=初始值+x*等级，x在内容里设置 7-11 消耗钻石 钻石= 初始值+y*（等级-6）

// 2. 宠物的提升相同的规则，最高可以升级到11级，初始等级是1级，升级到1级，等级变成满级
// 宠物不同时的是，宠物每一级别需要的材料都不一样，需要吞噬 武魂+金币+钻石

// 3. 宠物属性， 宠物是偏辅助类型的
// 幼鲲 + 防御（百分比） +金币
// 青龙 + 攻击（百分比）+ 移速
// 凤凰 + 生命（百分比）+ 穿透

let Pet: {}[] = [
    
    
    {"name":"凤凰","text":"描述","hp":"10","hpup":"0.5","arp":"500","arpup":"100","price":"10","priceup":"5","soul":"0,0,0,0,0,0,0,0,0,0"},
    {"name":"青龙","text":"描述","bonus":"5","bonusup":"0.5","sp":"10","spup":"1","price":"10","priceup":"5","soul":"0,0,0,0,0,0,0,0,0,0"},
    {"name":"幼鲲","text":"描述","def":"5","defup":"0.5","gold":"10","goldup":"1","price":"10","priceup":"5","soul":"0,0,0,0,0,0,0,0,0,0"},
    ];

// skillZY0: '雷灭斩',
// skillZY1: '雷动九天',
// skillZY2: '雷龙瞬杀',
// skillZY3: '神王天征',
// skillZY4: '不动如山',
// skillZY5: '醍醐灌顶',
// skillZY6: '无坚不摧',

// skillDC0: '连续攻击',
// skillDC1: '多重箭矢',
// skillDC2: '风神咆哮',
// skillDC3: '寒冰箭雨',
// skillDC4: '点石成金',
// skillDC5: '疾步如飞',
// skillDC6: '会心一击',


// skillDQ0: '地爆天星',
// skillDQ1: '黑洞',
// skillDQ2: '炎落斩',
// skillDQ3: '流星雨',
// skillDQ4: '会心一击',
// skillDQ5: '疾步如飞',
// skillDQ6: '无坚不摧',

// {name:'雷灭斩',price:[20,0,400,0,1000,1500,0,2000,0,3000,20,0,400,0,1000,1500,0,2000,0,3000], /*升级每一段所需，也可使用公式,0代表视频 */
//                      cd:16, dmg: 100,  text:'击退敌人,造成2段各dmg伤害',                                          /*配置属性和后面text里保持一致即可 */
//                      up: 20,                                                                                    /*每一次升级提升量 */
//                       description: '雷光化刃，一往无前'},

let Skill: {}[] = [
    {"id":"skillZY0","name":"雷灭斩","unlock":0,"price":200,"priceup":80,"cd":12,"cdup":0.1,"wave":1,"dmg":350,"dmgup":10,"text":"对敌人造成wave*dmg伤害","description":"一枪引雷动，一斩惊苍穹"},
    {"id":"skillZY1","name":"雷动九天","unlock":5,"price":300,"priceup":100,"cd":30,"cdup":0.5,"wave":9,"dmg":60,"dmgup":2,"text":"对敌人造成wave*dmg伤害","description":"九天玄雷，以枪引之"},
    {"id":"skillZY2","name":"雷龙瞬杀","unlock":10,"price":300,"priceup":120,"cd":15,"cdup":0.2,"wave":2,"dmg":180,"dmgup":6,"text":"对敌人造成wave*dmg伤害","description":"雷光化龙，一往无前"},
    {"id":"skillZY3","name":"神王天征","unlock":15,"price":400,"priceup":150,"cd":40,"cdup":0.4,"wave":9,"dmg":70,"dmgup":3,"text":"对敌人造成wave*dmg伤害","description":"以身为雷，万劫不复"},
    {"id":"skillZY4","name":"不动如山","unlock":10,"price":300,"priceup":100,"cd":"","cdup":"","wave":"","dmg":5,"dmgup":0.5,"text":"提升防御力总值dmg%","description":"提升人物防御力"},
    {"id":"skillZY5","name":"灵光灌顶","unlock":15,"price":300,"priceup":150,"cd":"","cdup":"","wave":"","dmg":5,"dmgup":1,"text":"提升经验获取dmg%","description":"提升人物经验获取"},
    {"id":"skillZY6","name":"无坚不摧","unlock":15,"price":400,"priceup":200,"cd":"","cdup":"","wave":"","dmg":5,"dmgup":0.5,"text":"提升攻击力dmg%","description":"提升人物攻击力"},
    {"id":"skillDC0","name":"审判之箭","unlock":0,"price":200,"priceup":80,"cd":12,"cdup":0.1,"wave":1,"dmg":360,"dmgup":8,"text":"对敌人造成wave*dmg伤害","description":"一箭判生死，一箭通幽冥"},
    {"id":"skillDC1","name":"疾风剑雨","unlock":0,"price":300,"priceup":100,"cd":15,"cdup":0.1,"wave":2,"dmg":240,"dmgup":6,"text":"对敌人造成wave*dmg伤害","description":"疾风箭雨，无坚不破"},
    {"id":"skillDC2","name":"风神连击","unlock":10,"price":300,"priceup":120,"cd":25,"cdup":0.2,"wave":4,"dmg":100,"dmgup":3,"text":"对敌人造成wave*dmg伤害","description":"面对疾风吧"},
    {"id":"skillDC3","name":"寒冰风暴","unlock":15,"price":400,"priceup":150,"cd":35,"cdup":0.4,"wave":4,"dmg":160,"dmgup":4,"text":"对敌人造成wave*dmg伤害","description":"寒冰风暴，血雨飘零"},
    {"id":"skillDC4","name":"点石成金","unlock":5,"price":300,"priceup":100,"cd":"","cdup":"","wave":"","dmg":10,"dmgup":1,"text":"提升金币获取dmg%","description":"提高金币获取效率"},
    {"id":"skillDC5","name":"疾步如飞","unlock":15,"price":300,"priceup":150,"cd":"","cdup":"","wave":"","dmg":10,"dmgup":1,"text":"提升移动速度dmg%","description":"大幅提升人物一速度"},
    {"id":"skillDC6","name":"百步穿杨","unlock":20,"price":400,"priceup":200,"cd":"","cdup":"","wave":"","dmg":5,"dmgup":0.2,"text":"减少敌人防御力dmg%","description":"减少敌人大量防御值"},
    {"id":"skillDQ0","name":"炎落斩","unlock":0,"price":200,"priceup":80,"cd":10,"cdup":0.5,"wave":4,"dmg":110,"dmgup":2,"text":"对敌人造成wave*dmg伤害","description":"召唤熔岩，吞噬敌人"},
    {"id":"skillDQ1","name":"流星雨","unlock":0,"price":300,"priceup":100,"cd":30,"cdup":0.1,"wave":9,"dmg":60,"dmgup":1.5,"text":"对敌人造成wave*dmg伤害","description":"召唤火雨风暴"},
    {"id":"skillDQ2","name":"黑洞","unlock":15,"price":300,"priceup":120,"cd":35,"cdup":0.1,"wave":15,"dmg":40,"dmgup":1,"text":"对敌人造成wave*dmg伤害","description":"吞噬万物"},
    {"id":"skillDQ3","name":"地爆天星","unlock":25,"price":400,"priceup":150,"cd":40,"cdup":0.2,"wave":10,"dmg":60,"dmgup":1,"text":"对敌人造成wave*dmg伤害","description":"地爆天星"},
    {"id":"skillDQ4","name":"会心一击","unlock":5,"price":300,"priceup":100,"cd":"","cdup":"","wave":"","dmg":5,"dmgup":0.1,"text":"提升暴击几率dmg%","description":"提高攻击造成致命一击的概率"},
    {"id":"skillDQ5","name":"疾步如飞","unlock":15,"price":300,"priceup":150,"cd":"","cdup":"","wave":"","dmg":10,"dmgup":1,"text":"提升移动速度dmg%","description":"大幅提升人物一速度"},
    {"id":"skillDQ6","name":"百步穿杨","unlock":20,"price":400,"priceup":200,"cd":"","cdup":"","wave":"","dmg":5,"dmgup":0.2,"text":"减少敌人防御力dmg%","description":"减少敌人大量防御值"},
    
    ];

/**
 * 装备 13101 01 02
 * 第一位数 类别 1-5 分别代表 武器 护甲 戒指 饰品 翅膀
 * 第二位数 专属 0-3 分别代表 通用 赵云 貂蝉 小乔
 * 第三位数 品阶 1-3 分别代表 蓝 绿 红
 * 第四五位 id   1-99
 * 第六七位 神宠附魔 0-99 0代表没附魔
 * 第八九位 强化等级 1-99
 */

	let Weapon: {}[] = [
        {"name":"幽冥","id":"13309","text":"冥界至宝，幽冥宝珠","atk":"450","atkup":"14","sp":"15","spup":"0.5","cr":"4","crup":"0.2","bonus":"","bonusup":"","cd":"10","cdup":"0.3","miss":"","missup":"","arp":"1000","arpup":"30","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"1030","priceup":"103"},
        {"name":"鬼火","id":"13208","text":"阴寒透骨","atk":"260","atkup":"8","sp":"10","spup":"0.3","cr":"4","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"5","missup":"0.2","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"0.3","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"610","priceup":"61"},
        {"name":"赤玉","id":"13107","text":"极品灵石制成，可以抵御伤害","atk":"155","atkup":"5","sp":"","spup":"","cr":"","crup":"","bonus":"3","bonusup":"0.1","cd":"","cdup":"","miss":"3","missup":"0.1","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"410","priceup":"41"},
        {"name":"落日","id":"12306","text":"后裔射日之弓，天火爆裂","atk":"450","atkup":"14","sp":"10","spup":"0.3","cr":"5","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"1500","arpup":"45","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"950","priceup":"95"},
        {"name":"裁决","id":"12205","text":"裁决之箭，主宰生死","atk":"240","atkup":"8","sp":"","spup":"","cr":"4","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"800","arpup":"24","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"550","priceup":"55"},
        {"name":"霜月弓","id":"12104","text":"寒霜映月，箭芒凌霄","atk":"115","atkup":"4","sp":"","spup":"","cr":"2","crup":"0.1","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"200","arpup":"6","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"280","priceup":"28"},
        {"name":"毒龙枪","id":"11202","text":"上古毒龙的獠牙制成，无坚不摧","atk":"220","atkup":"7","sp":"12","spup":"0.4","cr":"3","crup":"0.1","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"0.2","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"500","priceup":"50"},
        {"name":"青云枪","id":"11101","text":"有穿云裂石之力","atk":"105","atkup":"4","sp":"10","spup":"0.3","cr":"2","crup":"0.1","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"280","priceup":"28"},
        {"name":"霸王枪","id":"11303","text":"枪中霸王","atk":"420","atkup":"13","sp":"","spup":"","cr":"4","crup":"0.2","bonus":"6","bonusup":"0.2","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"500","defup":"15","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"1040","priceup":"104"},
        ];

    let Armor: {}[] =
     [
        {"name":"九彩霓裳","id":"23309","text":"女娲圣衣，妙法无穷","atk":"300","atkup":"9","sp":"20","spup":"0.6","cr":"5","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"2000","defup":"60","hp":"700","hpup":"21","ls":"1.5","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"950","priceup":"95"},
        {"name":"缠天带","id":"23208","text":"蕴含风灵之力，加成移速","atk":"150","atkup":"5","sp":"15","spup":"0.5","cr":"6","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"600","defup":"18","hp":"450","hpup":"14","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"540","priceup":"54"},
        {"name":"浑天绫","id":"23107","text":"太乙真人法宝改制而成，可增幅攻击","atk":"35","atkup":"2","sp":"","spup":"","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"500","defup":"15","hp":"350","hpup":"11","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"170","priceup":"17"},
        {"name":"夜琉璃","id":"22306","text":"如魅如夜，无法锁定","atk":"150","atkup":"5","sp":"30","spup":"0.9","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"4","missup":"0.2","arp":"","arpup":"","def":"2000","defup":"60","hp":"800","hpup":"24","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"620","priceup":"62"},
        {"name":"白鹤羽","id":"22205","text":"动如白鹤，影惊鸿","atk":"45","atkup":"2","sp":"20","spup":"0.6","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"4","missup":"0.2","arp":"","arpup":"","def":"900","defup":"27","hp":"600","hpup":"18","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"310","priceup":"31"},
        {"name":"寒蝉衣","id":"22104","text":"薄入蝉翼，水火不入","atk":"","atkup":"","sp":"10","spup":"0.3","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"350","defup":"11","hp":"150","hpup":"5","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"110","priceup":"11"},
        {"name":"八部天龙","id":"21302","text":"只有神选之人可以驾驭八部天龙之力","atk":"140","atkup":"5","sp":"","spup":"","cr":"","crup":"","bonus":"4","bonusup":"0.2","cd":"","cdup":"","miss":"3","missup":"0.1","arp":"","arpup":"","def":"2200","defup":"66","hp":"900","hpup":"27","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"680","priceup":"68"},
        {"name":"毒龙铠","id":"21203","text":"毒龙之力，腐蚀一切","atk":"35","atkup":"2","sp":"","spup":"","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"400","arpup":"12","def":"1000","defup":"30","hp":"600","hpup":"18","ls":"0.5","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"260","priceup":"26"},
        {"name":"灵蛇甲","id":"21101","text":"化蛟之蛇的鳞片缝制而成，刀枪不入","atk":"","atkup":"","sp":"","spup":"","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"3","missup":"0.1","arp":"","arpup":"","def":"390","defup":"12","hp":"120","hpup":"4","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"110","priceup":"11"},
        ];
                        
                        


let Ring: {}[] =
//  [{"id":"30301","name":"情人泪","text":"情人泪，最销魂","atk":"250","cr":"15","arp":"1000","ls":"7"},
//                     {"id":"30308","name":"似水流年","sp":"25","cr":"25","bonus":"15","miss":"15",},
//                     {"id":"30206","name":"将臣","cr":"10","arp":"500","hp":"500","ls":"6"},
//                     {"id":"30202","name":"守城","miss":"5","def":"1000","hp":"800",},
//                     {"id":"30203","name":"天芒","atk":"150","sp":"15","bonus":"5",},
//                     {"id":"30107","name":"碧玉戒","sp":"10","hp":"200","ls":"5"},
//                     {"id":"30104","name":"盘龙戒","atk":"20","def":"200","hp":"200",},
//                     {"id":"30105","name":"紫晶戒","sp":"15","cr":"10","arp":"200",},                             
//                     ];

                   [
                        {"name":"似水流年","id":"30308","text":"","atk":"75","atkup":"3","sp":"16","spup":"0.5","cr":"5","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"4","missup":"0.2","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"350","priceup":"35"},
                        {"name":"情人泪","id":"30301","text":"情人泪，最销魂","atk":"175","atkup":"6","sp":"","spup":"","cr":"3","crup":"0.1","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"1","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"410","priceup":"41"},
                        {"name":"将臣","id":"30206","text":"","atk":"","atkup":"","sp":"","spup":"","cr":"4","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"","defup":"","hp":"500","hpup":"15","ls":"1","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"220","priceup":"22"},
                        {"name":"天芒","id":"30203","text":"","atk":"100","atkup":"3","sp":"10","spup":"0.3","cr":"","crup":"","bonus":"2","bonusup":"0.1","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"290","priceup":"29"},
                        {"name":"守城","id":"30202","text":"","atk":"","atkup":"","sp":"","spup":"","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"3","missup":"0.1","arp":"","arpup":"","def":"800","defup":"24","hp":"700","hpup":"21","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"180","priceup":"18"},
                        {"name":"碧玉戒","id":"30107","text":"","atk":"15","atkup":"0.5","sp":"","spup":"","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"","defup":"","hp":"200","hpup":"6","ls":"1","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"120","priceup":"12"},
                        {"name":"紫晶戒","id":"30105","text":"","atk":"","atkup":"","sp":"","spup":"","cr":"3","crup":"0.1","bonus":"","bonusup":"   ","cd":"","cdup":"","miss":"","missup":"","arp":"200","arpup":"6","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"130","priceup":"13"},
                        {"name":"盘龙戒","id":"30104","text":"","atk":"30","atkup":"1","sp":"","spup":"","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"200","defup":"6","hp":"200","hpup":"6","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"120","priceup":"12"},
                    
					];


let Ornament: {}[] = [
                        {"name":"玄铁项链","id":"40306","text":"","atk":"120","atkup":"4","sp":"","spup":"","cr":"4","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"1000","defup":"30","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"430","priceup":"43"},
                        {"name":"烛龙之瞳","id":"40305","text":"","atk":"100","atkup":"3","sp":"","spup":"","cr":"","crup":"","bonus":"5","bonusup":"0.2","cd":"","cdup":"","miss":"","missup":"","arp":"600","arpup":"18","def":"","defup":"","hp":"","hpup":"","ls":"1","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"430","priceup":"43"},
                        {"name":"通灵宝玉","id":"40207","text":"","atk":"","atkup":"","sp":"","spup":"","cr":"4","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"300","defup":"9","hp":"300","hpup":"9","ls":"","lsup":"","exp":"10","expup":"0.3","gold":"10","goldup":"0.3","price":"190","priceup":"19"},
                        {"name":"千年琥珀","id":"40204","text":"","atk":"","atkup":"","sp":"10","spup":"0.3","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"600","defup":"18","hp":"","hpup":"","ls":"1","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"160","priceup":"16"},
                        {"name":"灵蛇玉","id":"40103","text":"","atk":"25","atkup":"1","sp":"","spup":"","cr":"2","crup":"0.1","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"10","goldup":"0.3","price":"130","priceup":"13"},
                        {"name":"金刚符","id":"40102","text":"","atk":"","atkup":"","sp":"","spup":"","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"250","defup":"8","hp":"150","hpup":"5","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"80","priceup":"8"},
                        {"name":"神行符","id":"40101","text":"","atk":"","atkup":"","sp":"10","spup":"0.3","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"2","missup":"0.1","arp":"","arpup":"","def":"","defup":"","hp":"75","hpup":"3","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"90","priceup":"9"},

					];
let Wing: {}[] = [
                        {"name":"血海彼岸花","id":"50306","text":"","atk":"165","atkup":"5","sp":"","spup":"","cr":"","crup":"","bonus":"3","bonusup":"0.1","cd":"","cdup":"","miss":"","missup":"","arp":"1500","arpup":"45","def":"","defup":"","hp":"","hpup":"","ls":"1","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"520","priceup":"52"},
                        {"name":"涅槃神凤翼","id":"50303","text":"","atk":"150","atkup":"5","sp":"15","spup":"0.5","cr":"4","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"4","missup":"0.2","arp":"","arpup":"","def":"1500","defup":"45","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"590","priceup":"59"},
                        {"name":"修罗霸王翼","id":"50302","text":"","atk":"200","atkup":"6","sp":"","spup":"","cr":"6","crup":"0.2","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"500","priceup":"50"},
                        {"name":"蝶恋花","id":"50204","text":"","atk":"","atkup":"","sp":"5","spup":"0.2","cr":"3","crup":"0.1","bonus":"","bonusup":"","cd":"","cdup":"","miss":"","missup":"","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"0.5","lsup":"0.1","exp":"","expup":"","gold":"","goldup":"","price":"150","priceup":"15"},
                        {"name":"幻影无极翼","id":"50105","text":"","atk":"","atkup":"","sp":"10","spup":"0.3","cr":"2","crup":"0.1","bonus":"","bonusup":"","cd":"","cdup":"","miss":"3","missup":"0.1","arp":"","arpup":"","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"140","priceup":"14"},
                        {"name":"九幽寒","id":"50101","text":"","atk":"45","atkup":"2","sp":"","spup":"","cr":"","crup":"","bonus":"","bonusup":"","cd":"","cdup":"","miss":"4","missup":"0.2","arp":"200","arpup":"6","def":"","defup":"","hp":"","hpup":"","ls":"","lsup":"","exp":"","expup":"","gold":"","goldup":"","price":"150","priceup":"15"},
                        
					];
                    
let Book: {}[] = [
    {"id":"71101","name":"水上漂","sp":"3.5",},
    {"id":"71102","name":"草上飞","sp":"3.5",},
    {"id":"71201","name":"金雁功","sp":"4.5",},
    {"id":"71202","name":"梯云纵","sp":"4.5",},
    {"id":"71301","name":"神行百变","sp":"5.5",},
    {"id":"71302","name":"凌波微步","sp":"5.5",},
    {"id":"71303","name":"乾坤大挪移","sp":"4.5","ls":"0.3",},
    {"id":"72101","name":"金钟罩","def":"50","hp":"35",},
    {"id":"72102","name":"铁布衫","def":"35","hp":"55",},
    {"id":"72201","name":"金刚不坏","def":"75","hp":"85",},
    {"id":"72202","name":"不动明王","def":"85","hp":"75",},
    {"id":"73101","name":"小无相功","cr":"1",},
    {"id":"73102","name":"紫霞神功","cr":"1.5",},
    {"id":"73201","name":"龙象般若功","cr":"2",},
    {"id":"73202","name":"九阴真经","atk":"10","cr":"2",},
    {"id":"73203","name":"化功大法","ls":"0.5",},
    {"id":"73301","name":"吸星大法","ls":"0.7",},
    {"id":"73302","name":"先天功","def":"100","cr":"2",},
    {"id":"73303","name":"九阳神功","atk":"10","cr":"2",},
    {"id":"73304","name":"易筋经","hp":"150","cr":"2",},
    {"id":"75101","name":"王八拳","atk":"8",},
    {"id":"75102","name":"野球拳","atk":"12",},
    {"id":"75201","name":"空明拳","atk":"15",},
    {"id":"75202","name":"太极拳","atk":"17",},
    {"id":"75301","name":"七伤拳","atk":"21",},
    {"id":"74101","name":"孙子兵法","exp":"3",},
    {"id":"74102","name":"孟德新书","gold":"3"},
    {"id":"74201","name":"太平清领道","exp":"5",},
    {"id":"74202","name":"太平要术","gold":"5"},
    {"id":"74301","name":"遁甲天书","exp":"4","gold":"4"},
    
    ];

// 武魂升级价格 
// 1-2 200 2-3 400 3-4 800 4-5 1000 5-6 2000

let Soul: {}[] = [
					{"name":"青狼","id":"60101","cr":"2",},
					{"name":"天狼","id":"60201","cr":"2.5","atk":"15",},
					{"name":"白泽","id":"60301","cr":"3.5","atk":"30",},
					{"name":"毕方","id":"60401","cr":"4","atk":"120","sp":"4",},
					{"name":"麒麟","id":"60501","cr":"6","atk":"220","bonus":"2",},
					{"name":"饕餮","id":"60601","cr":"7","atk":"350","bonus":"3",},
					{"name":"白蛇","id":"60102","miss":"3",},
					{"name":"飞蛇","id":"60202","miss":"3.5","arp":"300",},
					{"name":"蛟龙","id":"60302","atk":"30","miss":"4","arp":"500",},
					{"name":"角龙","id":"60402","atk":"150","miss":"4","arp":"600",},
					{"name":"青龙","id":"60502","atk":"230","miss":"4","arp":"1200",},
					{"name":"应龙","id":"60602","atk":"275","miss":"5","arp":"1400",},
					{"name":"黄鹤","id":"60103","arp":"250",},
					{"name":"神鹤","id":"60203","atk":"20","arp":"600",},
					{"name":"金乌","id":"60303","atk":"35","arp":"800",},
					{"name":"毕方","id":"60403","cr":"3","atk":"65","arp":"1000",},
					{"name":"朱雀","id":"60503","cr":"5","atk":"110","arp":"1800",},
					{"name":"凤凰","id":"60603","atk":"180","arp":"2000","def":"1500",},
					{"name":"石龟","id":"60104","def":"300",},
					{"name":"灵龟","id":"60204","def":"600",},
					{"name":"玄龟","id":"60304","cr":"2","def":"800",},
					{"name":"霸下","id":"60404","atk":"90","def":"900",},
					{"name":"玄武","id":"60504","atk":"180","def":"1300","hp":"400",},
					{"name":"混沌","id":"60604","atk":"200","def":"2000","hp":"800",},
					{"name":"黑虎","id":"60105","atk":"26",},
					{"name":"飞虎","id":"60205","atk":"55",},
					{"name":"狰章","id":"60305","atk":"100",},
					{"name":"陆吴","id":"60405","atk":"160","ls":"1",},
					{"name":"白虎","id":"60505","atk":"260","ls":"2",},
					{"name":"穷奇","id":"60605","atk":"300","ls":"3",},
					{"name":"青狐","id":"60106","cd":"4"},
					{"name":"灵狐","id":"60206","miss":"3.5","cd":"4"},
					{"name":"仙狐","id":"60306","cr":"2.5","miss":"4","cd":"4"},
					{"name":"青丘","id":"60406","cr":"3","miss":"5","ls":"1.5","cd":"4"},
					{"name":"心月","id":"60506","cr":"4","atk":"150","miss":"5.5","ls":"2","cd":"4"},
					{"name":"九尾","id":"60606","cr":"5","bonus":"6","miss":"6","ls":"3.5","cd":"6"},
					{"name":"乌鱼","id":"60107","hp":"350",},
					{"name":"巨鲸","id":"60207","cr":"1","hp":"700",},
					{"name":"螭吻","id":"60307","atk":"35","hp":"1100",},
					{"name":"巨鲲","id":"60407","atk":"70","def":"500","hp":"1200",},
					{"name":"魔鲲","id":"60507","atk":"140","def":"800","hp":"1400",},
					{"name":"雄鹰","id":"60108","sp":"8",},
					{"name":"神雕","id":"60208","sp":"9","bonus":"1",},
					{"name":"重明","id":"60308","cr":"3","sp":"10",},
					{"name":"大鹏","id":"60408","cr":"4","atk":"40","sp":"12","arp":"600",},
					{"name":"金鹏","id":"60508","cr":"4","atk":"60","sp":"14","bonus":"2","arp":"1500",},
					{"name":"鲲鹏","id":"60609","cr":"4","atk":"150","sp":"15","bonus":"3.5","hp":"1500",}

                ];
                
                let SoulRate: number[] = [.95, .79, .66, .46, .22, 0];
                let SoulSubRate: number[] = [.05, .05, .1, .15, .2, .3];


                let BizarreAdventureData: {}[] = 
                // [
                //     {"level":"1","type":"2","rate":"1","book":"73101","life":"5","gold":"150"},
                //     {"level":"2","type":"1","rate":"1","book":"75101","gem":"20","gold":"200",},
                //     {"level":"3","type":"2","rate":"1","book":"71101, 72101","gold":"200, 300, 400","life":"5, 7, 10",},
                //     {"level":"4","type":"1","rate":"1","book":"75102","gem":"29","soul":"60101"},
                //     {"level":"5","type":"3","rate":"1","book":"75101","item":"50105","soul":"60102"},
                //     {"level":"6","type":"2","rate":"1","gem": '20',"gold":"200, 250, 300","soul":"60102, 60103, 60104"},//只有2个 type为小兵2
                //     {"level":"7","type":"1","rate":"1","gem":"20","gold":"200, 250, 300","item":"30104","soul":"60105, 60106, 60107"}, //type已经从2改为1
                //     {"level":"8","type":"2","rate":"1","book":"71101, 72101","item":"30105","soul":"60102, 60107, 60108"},//type已经从2改为1
                //     {"level":"9","type":"1","rate":"1","book":"72102, 73102, 75102","life":"5, 7, 10","item":"40102, 30107",},
                //     {"level":"10","type":"3","rate":"1","gem":"10, 20, 30","life":"5","item":"22205",},
                //     {"level":"11","type":"2","rate":"1","book":"75201","gold":"300, 350, 400","life":"5","item":"21203","soul":"60202, 60207, 60208"},
                //     {"level":"12","type":"1","rate":"1","book":"73201, 75202","life":"5, 7, 10","soul":"60201, 60203, 60204"},
                //     {"level":"13","type":"2","rate":"1","book":"72202, 73202, 74202","gold":"300, 350, 400","item":"50101",},
                //     {"level":"14","type":"1","rate":"1","gem":"20, 30 ,40","gold":"300, 350, 400","soul":"60202, 60207, 60208"},
                //     {"level":"15","type":"3","rate":"1","gem":"50","gold":"300","item":"11202, 12205",},
                //     {"level":"16","type":"1","rate":"1","book":"71201","gold":"300, 350, 400","soul":"60205, 60206, 60207"},
                //     {"level":"17","type":"2","rate":"1","gem":"20, 30 ,40","item":"40103","soul":"60205, 60206, 60207"},
                //     {"level":"18","type":"1","rate":"1","book":"73201, 71201","gold":"300, 350, 400","item":"30203",},
                //     {"level":"19","type":"2","rate":"1","life":"5, 7, 10","item":"40204","soul":"60203, 60205, 60201"},
                //     {"level":"20","type":"3","rate":"1","gold":"300","life":"5","item":"22306",},
                //     {"level":"21","type":"2","rate":"1","gold":"300, 350, 400","item":"21302","soul":"60202, 60307, 60308"},
                //     {"level":"22","type":"1","rate":"1","book":"73301, 73302","gem":"20, 30 ,40","item":"30202",},
                //     {"level":"23","type":"2","rate":"1","gold":"300, 350, 400","life":"5, 7, 10","soul":"60301, 60303, 60305"},
                //     {"level":"24","type":"1","rate":"1","book":"73301, 71302","gem":"20, 30 ,40","item":"50204",},
                //     {"level":"25","type":"3","rate":"1","gem":"20, 30 ,40","gold":"300, 350, 400","item":"12306, 11303",},
                //     {"level":"26","type":"1","rate":"1","gold":"300, 350, 400","life":"5, 7, 10","soul":"60404, 60306, 60407"},
                //     {"level":"27","type":"2","rate":"1","book":"73302","gem":"20, 30 ,40","item":"40207",},
                //     {"level":"28","type":"1","rate":"1","book":"71301, 75301","gold":"300, 350, 400","item":"30206",},
                //     {"level":"29","type":"2","rate":"1","book":"71303, 73302","gem":"20, 30,40","item":"40306",},
                //     {"level":"30","type":"3","rate":"1","book":"75201","gem":"20, 30,40","item":"21302, 22205",},
                //     {"level":"31","type":"2","rate":"1","gold":"300, 350, 400","item":"11303, 12306","soul":"60402, 60407, 60508"},
                //     {"level":"32","type":"1","rate":"1","book":"73301","gem":"40, 50, 60","item":"50302",},
                //     {"level":"33","type":"2","rate":"1","gold":"300, 350, 400","item":"40305","soul":"60401, 60503, 60405"},
                //     {"level":"34","type":"1","rate":"1","book":"73301","gold":"300, 350, 400","item":"30308",},
                //     {"level":"35","type":"3","rate":"1","book":"72304, 71301","gem":"40, 50, 60","item":"30308",},
                //     {"level":"36","type":"1","rate":"1","gold":"300, 350, 400","life":"5, 7, 10","soul":"60504, 60406, 60507"},
                //     {"level":"37","type":"2","rate":"1","book":"73302","gem":"40, 50, 60","gold":"300, 350, 400",},
                //     {"level":"38","type":"1","rate":"1","book":"75301","gold":"300, 350, 400","item":"50303",},
                //     {"level":"39","type":"2","rate":"1","book":"74202","gem":"40, 50, 60","item":"50306",},
                //     {"level":"40","type":"3","rate":"1","book":"75201","gem":"40, 50, 60","gold":"300, 350, 400",},
                    
                //     ];
                
                // 72302改为73202
                [
                    {"level":"1","type":"2","rate":"1","book":"73101","gem":"","gold":"150","life":"5","item":"","soul":""},
                    {"level":"2","type":"1","rate":"1","book":"75101","gem":"20","gold":"200","life":"","item":"","soul":""},
                    {"level":"3","type":"2","rate":"1","book":"71101, 72101, 73101","gem":"","gold":"100, 200, 300","life":"5, 7, 10","item":"","soul":""},
                    {"level":"4","type":"1","rate":"1","book":"75102","gem":"29","soul":"60101"},
                    {"level":"5","type":"3","rate":"1","book":"75102","gem":"","gold":"","life":"","item":"50105","soul":"60101"},
                    {"level":"6","type":"2","rate":"1","book":"","gem":"20","gold":"200, 250, 400","life":"","item":"","soul":"60102, 60103, 60104"},
                    {"level":"7","type":"1","rate":"1","book":"","gem":"","gold":"200, 250, 400","life":"","item":"30104","soul":"60105, 60106, 60107"},
                    {"level":"8","type":"2","rate":"1","book":"71101, 72101","gem":"","gold":"","life":"","item":"30105","soul":"60102, 60107, 60108"},
                    {"level":"9","type":"2","rate":"1","book":"72102, 73102, 75102","gem":"","gold":"","life":"5, 7, 10","item":"40102, 30107","soul":""},
                    {"level":"10","type":"3","rate":"1","book":"","gem":"20, 30 ,40","gold":"","life":"5","item":"22205","soul":""},
                    {"level":"11","type":"2","rate":"1","book":"75201","gem":"","gold":"400, 450, 600","life":"5","item":"21203","soul":"60202, 60207, 60208"},
                    {"level":"12","type":"1","rate":"1","book":"73201, 75202","gem":"","gold":"","life":"5, 7, 10","item":"","soul":"60201, 60203, 60204"},
                    {"level":"13","type":"2","rate":"1","book":"72202, 73202, 74202","gem":"","gold":"400, 450, 600","life":"","item":"50101","soul":""},
                    {"level":"14","type":"1","rate":"1","book":"","gem":"25, 30 ,40","gold":"400, 450, 600","life":"","item":"","soul":"60202, 60207, 60208"},
                    {"level":"15","type":"3","rate":"1","book":"","gem":"50","gold":"600, 750, 900","life":"","item":"11202, 12205","soul":""},
                    {"level":"16","type":"1","rate":"1","book":"71201","gem":"","gold":"600, 750, 900","life":"","item":"","soul":"60205, 60206, 60207"},
                    {"level":"17","type":"2","rate":"1","book":"","gem":"30, 35 ,45","gold":"","life":"","item":"40103","soul":"60205, 60206, 60207"},
                    {"level":"18","type":"1","rate":"1","book":"73201, 71201","gem":"","gold":"800, 950, 1000","life":"","item":"30203","soul":""},
                    {"level":"19","type":"2","rate":"1","book":"","gem":"","gold":"","life":"5, 7, 10","item":"40204","soul":"60203, 60205, 60201"},
                    {"level":"20","type":"3","rate":"1","book":"","gem":"","gold":"800, 950, 1200","life":"5","item":"23208","soul":""},
                    {"level":"21","type":"2","rate":"1","book":"","gem":"","gold":"800, 950, 1200","life":"","item":"21302","soul":"60202, 60307, 60308"},
                    {"level":"22","type":"1","rate":"1","book":"73301, 73202","gem":"30, 40 ,50","gold":"","life":"","item":"30202","soul":""},
                    {"level":"23","type":"2","rate":"1","book":"","gem":"","gold":"900, 950, 1300","life":"","item":"22306","soul":"60301, 60303, 60305"},
                    {"level":"24","type":"1","rate":"1","book":"73301, 71302","gem":"30, 40 ,50","gold":"","life":"","item":"50204","soul":""},
                    {"level":"25","type":"3","rate":"1","book":"","gem":"30, 40 ,50","gold":"1000, 1250, 1500","life":"","item":"11303","soul":""},
                    {"level":"26","type":"1","rate":"1","book":"","gem":"","gold":"1000, 1250, 1500","life":"","item":"12306","soul":"60404, 60306, 60407"},
                    {"level":"27","type":"2","rate":"1","book":"73202","gem":"40, 50 ,70","gold":"","life":"","item":"13309","soul":""},
                    {"level":"28","type":"1","rate":"1","book":"71301, 75301","gem":"","gold":"1000, 1250, 1500","life":"","item":"23309","soul":""},
                    {"level":"29","type":"2","rate":"1","book":"71303, 73202","gem":"40, 50 ,70","gold":"","life":"","item":"40306","soul":""},
                    {"level":"30","type":"3","rate":"1","book":"72202","gem":"40, 50 ,70","gold":"","life":"","item":"21302, 22205","soul":""},
                    {"level":"31","type":"2","rate":"1","book":"","gem":"","gold":"1300, 1450, 1700","life":"5, 7, 10","item":"11303, 12306","soul":"60402, 60407, 60508"},
                    {"level":"32","type":"1","rate":"1","book":"73301","gem":"60, 80, 90","gold":"","life":"","item":"50302","soul":""},
                    {"level":"33","type":"2","rate":"1","book":"","gem":"","gold":"1300, 1450, 1700","life":"","item":"40305","soul":"60401, 60503, 60405"},
                    {"level":"34","type":"1","rate":"1","book":"73301","gem":"","gold":"1300, 1450, 1700","life":"","item":"30308","soul":""},
                    {"level":"35","type":"3","rate":"1","book":"72304, 71301","gem":"60, 80, 90","gold":"","life":"","item":"30301","soul":""},
                    {"level":"36","type":"1","rate":"1","book":"","gem":"","gold":"1300, 1450, 1700","life":"5, 7, 10","item":"","soul":"60504, 60406, 60507"},
                    {"level":"37","type":"2","rate":"1","book":"73302","gem":"60, 80, 90","gold":"1300, 1450, 1700","life":"","item":"","soul":""},
                    {"level":"38","type":"1","rate":"1","book":"75301","gem":"","gold":"1300, 1450, 1700","life":"","item":"50303","soul":""},
                    {"level":"39","type":"2","rate":"1","book":"74202","gem":"60, 80, 90","gold":"","life":"","item":"50306","soul":""},
                    {"level":"40","type":"3","rate":"1","book":"72202","gem":"60, 80, 90","gold":"1300, 1450, 1700","life":"","item":"","soul":""},
                    
                    ]

                    let MapBox = [
                        {"chapter":"1","type":"1","book":"73102","gem":"20","gold":"200",},
                        {"chapter":"1","type":"2","gem":"30","gold":"400","life":"4",},
                        {"chapter":"1","type":"3","gem":"40","gold":"600","soul":"60201"},
                        {"chapter":"2","type":"1","gem":"25","gold":"200","soul":"60202"},
                        {"chapter":"2","type":"2","gem":"35","gold":"500","soul":"60307"},
                        {"chapter":"2","type":"3","book":"71201","gem":"40","item":"30202",},
                        {"chapter":"3","type":"1","gem":"30","gold":"300","soul":"60309"},
                        {"chapter":"3","type":"2","book":"71302","gem":"50","gold":"600",},
                        {"chapter":"3","type":"3","gem":"60","gold":"800","item":"50204",},
                        {"chapter":"4","type":"1","book":"75201","gem":"35","gold":"450",},
                        {"chapter":"4","type":"2","gem":"55","gold":"750","soul":"60308"},
                        {"chapter":"4","type":"3","gem":"65","gold":"1000","item":"50303",},
                        {"chapter":"5","type":"1","book":"73202","gem":"40","gold":"400",},
                        {"chapter":"5","type":"2","gem":"60","gold":"600","soul":"60304"},
                        {"chapter":"5","type":"3","gem":"75","gold":"800","life":"5",},
                        {"chapter":"6","type":"1","gem":"50","gold":"500","soul":"60306"},
                        {"chapter":"6","type":"2","gem":"70","gold":"800","soul":"60405"},
                        {"chapter":"6","type":"3","book":"71301","gem":"80",},
                        {"chapter":"7","type":"1","gem":"60","gold":"300","soul":"60401"},
                        {"chapter":"7","type":"2","book":"71302","gem":"80","gold":"600",},
                        {"chapter":"7","type":"3","gem":"90","gold":"800","soul":"60403"},
                        {"chapter":"8","type":"1","book":"75301","gem":"70","gold":"450",},
                        {"chapter":"8","type":"2","gem":"90","gold":"750","life":"5",},
                        {"chapter":"8","type":"3","gem":"100","gold":"1000","soul":"60402"},
                        {"chapter":"9","type":"1","book":"73302","gem":"70","gold":"400",},
                        {"chapter":"9","type":"2","gem":"80","gold":"700","life":"5",},
                        {"chapter":"9","type":"3","gem":"100","gold":"800","soul":"60404"},
                        {"chapter":"10","type":"1","gem":"100","gold":"600","life":"5",},
                        {"chapter":"10","type":"2","gem":"110","gold":"800","soul":"60502"},
                        {"chapter":"10","type":"3","book":"71303","gem":"130","soul":"60503"},
                        {"chapter":"11","type":"1","gem":"120","gold":"600","life":"5",},
                        {"chapter":"11","type":"2","book":"73303","gem":"130","gold":"700",},
                        {"chapter":"11","type":"3","gem":"140","gold":"800","soul":"60505"},
                        {"chapter":"12","type":"1","book":"73203","gem":"150","gold":"900",},
                        {"chapter":"12","type":"2","gem":"160","gold":"750","soul":"60501"},
                        {"chapter":"12","type":"3","gem":"170","gold":"1000","item":"50303",},
                        
                        ];

let Task = 

[
    {"id":1,"title":"登录","name":"每日登录","unit":"次","amount":1,"gold":200,},
    {"id":2,"title":"通关","name":"完成冒险","unit":"次","amount":5,"gold":500,},
    {"id":3,"title":"击杀","name":"击败敌人","unit":"个","amount":60,"gold":600,},
    {"id":4,"title":"挑战","name":"获得关卡","unit":"星","amount":8,"dimond":15},
    {"id":5,"title":"排行","name":"查看排行榜","unit":"次","amount":1,"dimond":10},
    {"id":6,"title":"技能","name":"升级技能","unit":"次","amount":2,"dimond":10},
    {"id":7,"title":"装备","name":"升级装备","unit":"次","amount":3,"dimond":15},
    {"id":8,"title":"武魂","name":"合成武魂","unit":"次","amount":2,"dimond":20},
    {"id":9,"title":"神宠","name":"升级神宠","unit":"次","amount":1,"dimond":15},
    
    ];

let Achieve = 

[
    {"id":1,"title":"登录","name":"连续登录","unit":"次","amount":[1,2,3,4,5,6,7],"gold":[100,200,300,400,500,600,1000],},
    {"id":2,"title":"通关","name":"完成冒险","unit":"次","amount":[5,15,30,50,75,100],"gold":[100,300,400,500,600,1000],},
    {"id":3,"title":"击杀","name":"击败敌人","unit":"个","amount":[50,100,300,500,1000],"gold":[300,500,600,1000,1500],},
    {"id":4,"title":"挑战","name":"获得","unit":"星","amount":[10,30,50,90,120,180],"dimond":[10,40,70,90,120,140]},
    {"id":5,"title":"排行","name":"排行榜上","unit":"名","amount":[100,50,40,30,20,10,5],"dimond":[30,50,60,70,80,90,100]},
    {"id":6,"title":"技能","name":"升级技能","unit":"次","amount":[5,10,15,20,25,30,40],"dimond":[10,20,30,40,50,60,70]},
    {"id":7,"title":"装备","name":"升级装备","unit":"次","amount":[4,8,12,16,20,24,30],"dimond":[10,15,20,30,40,50,60]},
    {"id":8,"title":"武魂","name":"合成武魂","unit":"次","amount":[6,10,15,20,30],"dimond":[20,40,60,80,100]},
    {"id":9,"title":"神宠","name":"升级神宠","unit":"次","amount":[2,5,10,20,30],"dimond":[30,40,50,70,100]},
    {"id":10,"title":"等级","name":"等级达到","unit":"级","amount":[5,10,20,30,50,70,100],"gold":[100,200,400,600,800,1500,2000],"dimond":[10,15,25,30,45,65,100]},
    ];

let Eight = 
[
    {"id":1,"name":"乾","rate":0.25,"factor":[10,13,17],"book":"","gem":"","gold":[200,500,1000],"life":"","item":"","soul":""},
    {"id":2,"name":"坤","rate":0.15,"factor":[0,0,0],"book":"","gem":[15,30,45],"gold":"","life":"","item":"","soul":""},
    {"id":3,"name":"震","rate":0.1,"factor":[0.02,0.05,0.03],"book":[1,1,2],"gem":"","gold":"","life":"","item":"","soul":""},
    {"id":4,"name":"坎","rate":0.1,"factor":[0.05,0.05,0.05],"book":"","gem":"","gold":"","life":"","item":[1,1.2,1.5],"soul":""},
    {"id":5,"name":"离","rate":0.2,"factor":[0,0,0],"book":"","gem":"","gold":"","life":[5,8,12],"item":"","soul":""},
    {"id":6,"name":"兑","rate":0.25,"factor":[0,0,0],"book":"","gem":"","gold":"","life":"","item":"","soul":[1,2,3]},
    
    ];

    


/**
 * 
序号属性	缩写	                 备注
1	攻击	atk	
2	防御	def	                    减伤%=防御力/（防御力+1000）
3	血量	hp	
4	吸血	ls(lifesteal)	
5	移速	sp	
6	暴击	cr	
7	穿透	arp(armor peneration)	减少敌人护甲值
8	攻击增幅	Bonus	            百分比
9	减少冷却	CD	                百分比
10	闪避	miss	                百分比
11	经验	exp	                    百分比
12	金钱	gold	                百分比

 */

let getLevelCoins = (level: number)=>{
    return Math.floor(level * 1.5 + level * level / 10 + 15);
}

let getLevelExp = (level: number)=>{
    return Math.floor(level * 8 + level * level / 5 + 10);
}

let getTypeId = (id: number)=>{
    // return Math.floor(id / 10000);
    // cc.log(parseInt(id.toString().substr(0, 1)));
    console.log(id);
    if(id == -1 || id == undefined) return;
    return parseInt(id.toString().substr(0, 1));
}

let getWhoId = (id: number)=>{
    // return Math.floor(id % 10000 / 1000);
    return parseInt(id.toString().substr(1, 1));
}

let getLvId = (id: number)=>{
    // return Math.floor(id % 1000 / 100);
    // cc.log(id);
    return parseInt(id.toString().substr(2, 1));
}

let getIndexId = (id: number)=>{
    // return id % 100;
    if(id == -1 || id == undefined) return;
    return parseInt(id.toString().substr(3, 2));
}

let getSoulId = (id: number)=>{
    return parseInt(id.toString().substr(5, 2));
}

let getSoulIndexById = (id: number)=>{
    for (let i = 0; i < Soul.length; i++) {
        if(Soul[i].id == id){
            return i + 1;
        }
        
    }
    return 0;
}

let getSoulDataById = (index: number)=>{
    return Soul[index];
}

let getUpgradeId = (id: number)=>{
    return parseInt(id.toString().substr(7, 2));
}

let getJsonId = (id: number)=>{
    return parseInt(id.toString().substr(0, 5));
}

let getDataById = (id: number)=>{
    // cc.log(id);
    let arrs = null;
    switch (getTypeId(id)) {
        case 1:
            arrs = Weapon;
            break;
        case 2:
            arrs = Armor;
            break;
        case 3:
            arrs = Ring;
            break;
        case 4:
            arrs = Ornament;
            break;
        case 5:
            arrs = Wing;
            break;
        case 6:
            arrs = Soul;
            break;
        case 7:
            arrs = Book;
            break;
        default:
            break;
    }
    id = getJsonId(id);
    for (let i = 0; i < arrs.length; i++) {
        let item = arrs[i];
        // cc.log(item);
        if(item.id == id){
            return item;
        }
    }
    return null;
}

let getSoulIds = ()=>{
    let arrs: [] = [];
    Soul.forEach(element => {
        arrs.push(element.id);
    });
    return arrs;
}

export {getTypeId, getWhoId, getLvId, getIndexId, getDataById, getJsonId, getSoulId, Skill, AttArrs, Task, Achieve,
     getUpgradeId, Exp, RewardExp, RewardCoins, MonsterHP, MonsterATK, getSoulIndexById, Book, Pet, MapBox, TipString, Soul,
      MonsterArmor, HeroSkillName, MapTitle, getLevelCoins, getLevelExp, getSoulDataById, getSoulIds, SoulRate, SoulSubRate,
       BgName, HeroSpName, PetSpName, Weapon, Armor, Ring, Ornament, Wing, BizarreAdventureData,Eight,
        HeroName, PetName, SkillNameArrs, MapData}